[
  {
    "supplication": "اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا علَى طَاعَتِكَ",
    "hadith": "{إنَّ قُلُوبَ بَنِي آدَمَ كُلَّهَا بيْنَ إِصْبَعَيْنِ مِن أَصَابِعِ الرَّحْمَنِ، كَقَلْبٍ وَاحِدٍ، يُصَرِّفُهُ حَيْثُ يَشَاءُ، ثُمَّ قالَ رَسُولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ: اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا علَى طَاعَتِكَ}",
    "source": "صحيح مسلم: 2654"
  },
  {
    "supplication": "اللَّهُمَّ إنِّي أَسْأَلُكَ الهُدَى وَالتُّقَى، وَالْعَفَافَ وَالْغِنَى",
    "hadith":"عَن ابنِ مسْعُودٍ ، أَنَّ النَّبِيَّ ﷺ كَانَ يَقُولُ: اللَّهُمَّ إِنِي أَسْأَلُكَ الهُدَى، وَالتُّقَى، وَالعفَافَ، والغنَى",
    "source": "صحيح مسلم: 2721"
  },
  {
    "supplication": "اللَّهُمَّ أَصْلِحْ لي دِينِي الذي هو عِصْمَةُ أَمْرِي، وَأَصْلِحْ لي دُنْيَايَ الَّتي فِيهَا معاشِي، وَأَصْلِحْ لي آخِرَتي الَّتي فِيهَا معادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لي في كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لي مِن كُلِّ شَرٍّ",
    "hadith": "كانَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ يقولُ: اللَّهُمَّ أَصْلِحْ لي دِينِي الذي هو عِصْمَةُ أَمْرِي، وَأَصْلِحْ لي دُنْيَايَ الَّتي فِيهَا معاشِي، وَأَصْلِحْ لي آخِرَتي الَّتي فِيهَا معادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لي في كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لي مِن كُلِّ شَرٍّ.",
    "source": "صحيح مسلم: 2720"
  },
  {
    "supplication":"اللَّهُمَّ رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً، وفي الآخِرَةِ حَسَنَةً، وقِنَا عَذَابَ النَّارِ",
    "hadith":"كانَ أكْثَرُ دُعَاءِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ: اللَّهُمَّ رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً، وفي الآخِرَةِ حَسَنَةً، وقِنَا عَذَابَ النَّارِ.",
    "source": "صحيح البخاري: 6389"
  },
  {
    "supplication":"اللَّهمَّ اغفِر لي وارحَمني واهدِني وارزُقني",
    "hadith":"صَلَّى اللَّهُ عليه وسلَّمَ وَأَتَاهُ رَجُلٌ، فَقالَ: يا رَسولَ اللهِ، كيفَ أَقُولُ حِينَ أَسْأَلُ رَبِّي؟ قالَ: قُلِ: اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَعَافِنِي، وَارْزُقْنِي. وَيَجْمَعُ أَصَابِعَهُ إلَّا الإبْهَامَ؛ فإنَّ هَؤُلَاءِ تَجْمَعُ لكَ دُنْيَاكَ وَآخِرَتَكَ.",
    "source": "صحيح مسلم: 2697"
  },
  {
    "supplication":"اللَّهمَّ ربَّ السَّمواتِ السَّبعِ، وربَّ العرشِ العظيمِ، ربَّنا وربَّ كلِّ شيءٍ منزِلَ التَّوراةِ والإنجيلِ والقرآنِ، فالقَ الحبِّ والنَّوى، أعوذُ بِكَ من شرِّ كلِّ شيءٍ أنتَ آخذٌ بناصيتِهِ، أنتَ الأوَّلُ فليسَ قبلَكَ شيءٌ، وأنتَ الآخِرُ فليسَ بعدَكَ شيءٌ، وأنتَ الظَّاهرُ فليسَ فوقَكَ شيءٌ، وأنتَ الباطنُ فليسَ دونَكَ شيءٌ، اقضِ عنِّي الدَّين، وأغنِني منَ الفقرِ",
    "hadith": "جاءت فاطمةُ إلى النَّبيِّ صلَّى اللَّهُ عليْهِ وسلَّمَ تسألُهُ خادمًا، فقالَ لَها: ´´قولي: اللَّهمَّ ربَّ السَّمواتِ السَّبعِ، وربَّ العرشِ العظيمِ، ربَّنا وربَّ كلِّ شيءٍ منزِلَ التَّوراةِ والإنجيلِ والقرآنِ، فالقَ الحبِّ والنَّوى، أعوذُ بِكَ من شرِّ كلِّ شيءٍ أنتَ آخذٌ بناصيتِهِ، أنتَ الأوَّلُ فليسَ قبلَكَ شيءٌ، وأنتَ الآخِرُ فليسَ بعدَكَ شيءٌ، وأنتَ الظَّاهرُ فليسَ فوقَكَ شيءٌ، وأنتَ الباطنُ فليسَ دونَكَ شيءٌ، اقضِ عنِّي الدَّين، وأغنِني منَ الفقرِ",
    "source": "صحيح الترمذي: 3481"
  },
  {
    "supplication": "اللَّهُمَّ اجْعَلْ في قَلْبِي نُورًا، وفي بَصَرِي نُورًا، وفي سَمْعِي نُورًا، وعَنْ يَمِينِي نُورًا، وعَنْ يَسارِي نُورًا، وفَوْقِي نُورًا، وتَحْتي نُورًا، وأَمامِي نُورًا، وخَلْفِي نُورًا، واجْعَلْ لي نُورًا",
    "hadith": "بِتُّ عِنْدَ مَيْمُونَةَ، فَقامَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ فأتَى حاجَتَهُ، فَغَسَلَ وجْهَهُ ويَدَيْهِ، ثُمَّ نامَ، ثُمَّ قامَ، فأتَى القِرْبَةَ فأطْلَقَ شِناقَها، ثُمَّ تَوَضَّأَ وُضُوءًا بيْنَ وُضُوءَيْنِ لَمْ يُكْثِرْ وقدْ أبْلَغَ، فَصَلَّى، فَقُمْتُ فَتَمَطَّيْتُ، كَراهيةَ أنْ يَرَى أنِّي كُنْتُ أتَّقِيهِ، فَتَوَضَّأْتُ، فَقامَ يُصَلِّي، فَقُمْتُ عن يَسارِهِ، فأخَذَ بأُذُنِي فأدارَنِي عن يَمِينِهِ، فَتَتامَّتْ صَلاتُهُ ثَلاثَ عَشْرَةَ رَكْعَةً، ثُمَّ اضْطَجَعَ فَنامَ حتَّى نَفَخَ، وكانَ إذا نامَ نَفَخَ، فَآذَنَهُ بلالٌ بالصَّلاةِ، فَصَلَّى ولَمْ يَتَوَضَّأْ، وكانَ يقولُ في دُعائِهِ: اللَّهُمَّ اجْعَلْ في قَلْبِي نُورًا، وفي بَصَرِي نُورًا، وفي سَمْعِي نُورًا، وعَنْ يَمِينِي نُورًا، وعَنْ يَسارِي نُورًا، وفَوْقِي نُورًا، وتَحْتي نُورًا، وأَمامِي نُورًا، وخَلْفِي نُورًا، واجْعَلْ لي نُورًا. قالَ كُرَيْبٌ: وسَبْعٌ في التَّابُوتِ، فَلَقِيتُ رَجُلًا مِن ولَدِ العبَّاسِ، فَحدَّثَني بهِنَّ، فَذَكَرَ عَصَبِي ولَحْمِي ودَمِي وشَعَرِي وبَشَرِي، وذَكَرَ خَصْلَتَيْنِ.",
    "source": "صحيح البخاري: 6316"
  },
  {
    "supplication":"اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، ولَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ، فَاغْفِرْ لي مَغْفِرَةً مِن عِندِكَ، وارْحَمْنِي إنَّكَ أنْتَ الغَفُورُ الرَّحِيمُ",
    "hadith": "أنَّهُ قالَ لِرَسولِ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: عَلِّمْنِي دُعَاءً أدْعُو به في صَلَاتِي، قالَ: قُلْ: اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، ولَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ، فَاغْفِرْ لي مَغْفِرَةً مِن عِندِكَ، وارْحَمْنِي إنَّكَ أنْتَ الغَفُورُ الرَّحِيمُ.",
    "source": "صحيح البخاري: 834"
  },
  {
    "supplication":"اللَّهمَّ أَحيِني مِسكينًا، وأَمِتْني مِسكينًا، واحشُرني في زُمرةِ المساكينِ يومَ القيامَةِ",
    "hadith": "عن أنس، أن رسول الله صلى الله عليه وسلم قال: ((اللهُمَّ أحيني مسكينًا، وأمتني مسكينًا، واحشرني في زمرة المساكين يوم القيامة))، فقالت عائشة: لِمَ يا رسول الله؟ قال: ((إنهم يدخلون الجنة قبل أغنيائهم بأربعين خريفًا، يا عائشة، لا ترُدِّي المسكين ولو بشق تمرة، يا عائشة، أحبي المساكين، وقربيهم؛ فإن الله يقربك يوم القيامة",
    "source": "صحيح الترمذي: 2352"
  },
  {
    "supplication":"اللَّهمَّ إِنِّي أَعُوذُ بِكَ مِن منْكَرَاتِ الأَخلاقِ، والأعْمَالِ والأَهْواءِ",
    "hadith": "وعَن زيادِ بْن عِلاقَةَ عن عمِّه، وَهُوَ قُطبَةُ بنُ مالِكٍ، قَال: كَانَ النَّبيُّ ﷺ يقُولُ: اللَّهمَّ إِنِّي أَعُوذُ بِكَ مِن منْكَرَاتِ الأَخلاقِ، والأعْمَالِ والأَهْواءِ",
    "source": "صحيح الترمذي: 3591"
  },
  {
    "supplication":"اللهم إنك عفو كريم تحب العفو فاعف عني",
    "hadith": "عن عائشة رضي الله عنها قالت: قلت يارسول الله: أرأيت إن علمت أي ليلة ليلة القدر ما أقول فيها، قال: قولي اللهم إنك عفو كريم تحب العفو فاعف عني",
    "source": "صحيح ابن ماجة: 3119"
  },
  {
    "supplication":"اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي وَخَطَئِي وَعَمْدِي وَكُلُّ ذَلِكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "hadith": "عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَدْعُو بِهَذَا الدُّعَاءِ : اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي وَخَطَئِي وَعَمْدِي وَكُلُّ ذَلِكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "source": "صحيح البخاري: 6398"
  },
  {
    "supplication":"اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "hadith": "عن شداد بن أوس رضي الله عنه أن النبي صلى الله عليه وسلم قال:سَيِّدُ الاسْتِغْفَارِ أَنْ تَقُولَ: اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، قَالَ: وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ",
    "source": "صحيح البخاري: 6306"
  },
  {
    "supplication":"اللَّهمَّ إني أعوذُ بك من القِلَّةِ والفقرِ والذِّلَّةِ ، وأعوذُ بك أن أَظْلِمَ أو أُظْلَمَ",
    "hadith": "أنَّ النبيَّ صلَّى اللهُ عليْهِ وسلَّمَ كان يقولُ اللَّهمَّ إني أعوذُ بك من القِلَّةِ والفقرِ والذِّلَّةِ ، وأعوذُ بك أن أَظْلِمَ أو أُظْلَمَ",
    "source": "صحيح النسائي: 5477"
  },
  {
    "supplication":"اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والجبن والبخل وضلع الدين وغلبة الرجال",
    "hadith": "عن أنس بن مالك قال: كان النبي صلى الله عليه وسلم يقول: اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والجبن والبخل وضلع الدين وغلبة الرجال.",
    "source": "صحيح البخاري: 2893"
  },
  {
    "supplication":"اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ جَهْدِ البَلاَءِ، وَدَرْكِ الشَقَاءِ، وَسُوءِ القَضَاءِ، وَشَمَاتَةَ الأَعْدَاءِ.",
    "hadith": "عن أبي هريرة: كان رسول الله صلى الله عليه وسلم يتعوذ من جهد البلاء ودرك الشقاء وسوء القضاء وشماتة الأعداء.",
    "source": "صحيح البخاري: 6347"
  },
  {
    "supplication":"اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل",
    "hadith": "سألت عائشة عما كان رسول الله صلى الله عليه وسلم يدعو به الله قالت كان يقول اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل",
    "source": "صحيح مسلم: 2716"
  },
  {
    "supplication":"اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك مِن أن أُرَد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وأعوذ بك من عذاب القبر",
    "hadith": "عن سعد بن أبي وقاص رضي الله عنه أن النبي صلى الله عليه وسلم: كان يتعوَّذ بهن دبر كل صلاة: اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك مِن أن أُرَد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وأعوذ بك من عذاب القبر",
    "source": "صحيح البخاري: 6390"
  },
  {
    "supplication":"اللهم إني أعوذ بك من زوال نعمتك، وتحوُّل عافيتك، وفُجاءة نقمتك، وجميع سخطك",
    "hadith": "عن عبدالله بن عمر - رضي الله عنهما - قال: قال رسول الله - صلى الله عليه وسلم: اللهم إني أعوذ بك من زوال نعمتك، وتحوُّل عافيتك، وفُجاءة نقمتك، وجميع سخطك",
    "source": "صحيح مسلم: 2739"
  },
  {
    "supplication":"اللهُمَّ إِنِّي أَعُوذُ بِرِضَاك مِنْ سَخَطِك، وَبِمُعَافَاتِك مِنْ عُقُوبَتِك، وَأَعُوذُ بِكَ مِنْك، لَا أُحْصِي ثَنَاءً عَلَيْك، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِك",
    "hadith": "عن أم المؤمنين عائشة رضي الله عنها قالت: (فَقَدْتُ (لم أجد) رَسُولَ الله صلى الله عليه وسلم لَيْلَةً مِنَ الْفِرَاش فَالْتَمَسْتُه (بحثت عنه)، فَوَقَعَتْ يَدِي عَلَى بَطْنِ قَدَمَيْه وهو في الْمَسْجِد - وفي رواية وهو ساجِد - وهما مَنْصُوبَتَان وهو يقول: اللهُمَّ إِنِّي أَعُوذُ بِرِضَاك مِنْ سَخَطِك، وَبِمُعَافَاتِك مِنْ عُقُوبَتِك، وَأَعُوذُ بِكَ مِنْك، لَا أُحْصِي ثَنَاءً عَلَيْك، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِك",
    "source": "صحيح مسلم: 486"
  },
  {
    "supplication":"اللهمَّ إني أعوذُ بكَ من العجزِ والكسلِ والجُبنِ والبُخلِ والهمِّ وعذابِ القبرِ وفتنةِ الدجَّالِ اللهم آتِ نفسي تقواها أنت خيرُ مَن زكَّاها أنت وليُّها ومولاها أعوذُ بك من قلبٍ لا يخشعُ وعلمٍ لا ينفعُ ودُعاءٍ لا يُسمعُ",
    "hadith": "كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يقولُ اللهمَّ إني أعوذُ بكَ من العجزِ والكسلِ والجُبنِ والبُخلِ والهمِّ وعذابِ القبرِ وفتنةِ الدجَّالِ اللهم آتِ نفسي تقواها أنت خيرُ مَن زكَّاها أنت وليُّها ومولاها أعوذُ بك من قلبٍ لا يخشعُ وعلمٍ لا ينفعُ ودُعاءٍ لا يُسمعُ أو قال دعوةٍ لا يُستجابُ لها",
    "source": "صحيح مسلم: 2722"
  },
  {
    "supplication":"اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلاَ تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا، وَلاَ مَبْلَغَ عِلْمِنَا، وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لاَ يَرْحَمُنَا",
    "hadith": "عن ابن عمر رضي الله عنهما قال: قَلَّمَا كَانَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُومُ مِنْ مَجْلِسٍ حَتَّى يَدْعُوَ بِهَؤُلاَءِ الدَّعَوَاتِ لأَصْحَابِهِ: اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلاَ تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا، وَلاَ مَبْلَغَ عِلْمِنَا، وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لاَ يَرْحَمُنَا",
    "source": "صحيح الترمذي: 3502"
  },
  {
    "supplication":"اللهم إني أعوذ بك من فتنة النار وعذاب النار وفتنة القبر وعذاب القبر وشر فتنة الغنى وشر فتنة الفقر اللهم إني أعوذ بك من شر فتنة المسيح الدجال اللهم اغسل قلبي بماء الثلج والبرد ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب اللهم إني أعوذ بك من الكسل والمأثم والمغرم",
    "hadith": "عن عائشة رضي الله عنها قالت كان النبي صلى الله عليه وسلم يقول اللهم إني أعوذ بك من فتنة النار وعذاب النار وفتنة القبر وعذاب القبر وشر فتنة الغنى وشر فتنة الفقر اللهم إني أعوذ بك من شر فتنة المسيح الدجال اللهم اغسل قلبي بماء الثلج والبرد ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب اللهم إني أعوذ بك من الكسل والمأثم والمغرم",
    "source": "صحيح البخاري: 6377"
  },
  {
    "supplication":"اللهم رب جبرائيل وميكائيل ورب إسرافيل أعوذ بك من حر النار ومن عذاب القبر",
    "hadith": "عن عائشة أنها قالت قال رسول الله صلى الله عليه وسلم اللهم رب جبرائيل وميكائيل ورب إسرافيل أعوذ بك من حر النار ومن عذاب القبر",
    "source": "صحيح النسائي: 5534"
  },
  {
    "supplication":"اللَّهمَّ إنِّي أعوذُ بكَ منَ الهدْمِ وأعوذُ بكَ منَ التَّردِّي وأعوذُ بكَ منَ الغرَقِ والحرْقِ والهرَمِ وأعوذُ بكَ أن يتخبَّطني الشَّيطانُ عندَ الموتِ وأعوذُ بكَ أن أموتَ في سبيلِكَ مدبرًا وأعوذُ بكَ أن أموتَ لديغًا",
    "hadith": "أنَّ رسولَ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ كانَ يدعو اللَّهمَّ إنِّي أعوذُ بكَ منَ الهدْمِ وأعوذُ بكَ منَ التَّردِّي وأعوذُ بكَ منَ الغرَقِ والحرْقِ والهرَمِ وأعوذُ بكَ أن يتخبَّطني الشَّيطانُ عندَ الموتِ وأعوذُ بكَ أن أموتَ في سبيلِكَ مدبرًا وأعوذُ بكَ أن أموتَ لديغًا",
    "source": "صحيح ابي داوود: 1552"
  },
  {
    "supplication":"رَبِّ أعِنِّي ولا تُعِنْ عليَّ، وانصُرْني ولا تنصُرْ عليَّ، وامكُرْ لي ولا تمكُرْ عليَّ، واهْدِني ويَسِّرْ هُدايَ إليَّ، وانصُرْني على مَن بغى عليَّ، اللَّهُمَّ اجعَلْني لك شاكِرًا، لك ذاكِرًا، لك راهِبًا ، لك مِطواعًا، إليك مُخبِتًا أو مُنيبًا، رَبِّ تقَبَّلْ توبتي، واغسِلْ حَوْبتي، وأجِبْ دَعوتي، وثَبِّتْ حُجَّتي، واهْدِ قَلبي، وسَدِّدْ لِساني، واسْلُلْ سَخيمةَ قلبي",
    "hadith": "كان النَّبيُّ صلَّى اللهُ عليه وسلَّم يدعو: رَبِّ أعِنِّي ولا تُعِنْ عليَّ، وانصُرْني ولا تنصُرْ عليَّ، وامكُرْ لي ولا تمكُرْ عليَّ، واهْدِني ويَسِّرْ هُدايَ إليَّ، وانصُرْني على مَن بغى عليَّ، اللَّهُمَّ اجعَلْني لك شاكِرًا، لك ذاكِرًا، لك راهِبًا ، لك مِطواعًا، إليك مُخبِتًا أو مُنيبًا، رَبِّ تقَبَّلْ توبتي، واغسِلْ حَوْبتي، وأجِبْ دَعوتي، وثَبِّتْ حُجَّتي، واهْدِ قَلبي، وسَدِّدْ لِساني، واسْلُلْ سَخيمةَ قلبي",
    "source": "صحيح ابي داوود: 1510"
  },
  {
    "supplication":"اللهمَّ إني أسألُكَ الخيراتِ وتَرْكَ المنكراتِ وحُبَّ المساكينِ وإذا أردتَ بعبادِكَ فتنةً أن تقبضَني إليكَ غيرَ مفتونٍ",
    "hadith": "أتاني رَبِّي عزَّ وجلَّ الليلةَ في أحسنِ صورةٍ أحسبُهُ يعني في النومِ فقال : يا محمدُ هل تدري فيمَ يختصمُ الملأُ الأعلَى قال : قلتُ : لا قالَ النبيُّ صلَّى اللهُ عليهِ وسلَّمَ : فوضعَ يدَهُ بينَ كَتِفَيَّ حتى وجدتُ بَرْدَهَا بينَ ثَدْيَيَّ أو قال : نَحْرِي فعلمتُ ما في السمواتِ وما في الأرضِ ثم قال : يا محمدُ هل تدري فيمَ يختصمُ الملأُ الأعلى قال : قلتُ : نعم يَختصمونَ في الكّفَّاراتِ والدَرَجَاتِ قال : وما الكَفَّاراتُ والدَرَجَاتُ قال : المُكْثُ في المساجدِ والمَشْيُ على الأقدامِ إلى الجُمُعَاتِ وإبلاغُ الوُضوءِ في المكارهِ ومن فعلَ ذلك عاشَ بخيرٍ ومات بخيرٍ وكان من خطيئتِهِ كيومِ ولدتهُ أمُّهُ وقُلْ يا محمدُ إذا صلَّيتَ : اللهمَّ إني أسألُكَ الخيراتِ وتَرْكَ المنكراتِ وحُبَّ المساكينِ وإذا أردتَ بعبادِكَ فتنةً أن تقبضَني إليكَ غيرَ مفتونٍ قال : والدرجاتُ بَذْلُ الطعامِ وإفشاءُ السلامِ والصلاةُ بالليلِ والناسُ نِيَامٌ",
    "source": "صحيح الترمذي: 3233"
  },
  {
    "supplication":"يا مقلِّبَ القلوبِ ثَبِّتْ قلبِي على دينِك",
    "hadith": "كان رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّمَ يُكثرُ أن يقولَ يا مقلِّبَ القلوبِ ثَبِّتْ قلبِي على دينِك فقلت يا نبيَّ اللهِ آمنَّا بك وبما جئتَ به فهل تخافُ علينا؟ قال نعم إن القلوبَ بينَ إصبعينِ من أصابعِ اللهِ يُقلِّبُها كيفَ يشاءُ",
    "source": "صحيح الترمذي: 2140"
  }
]