package com.ottrojja.screens.reminderScreen

object DynamicReminderMessageProvider {
    fun getMessage(): String {
        val messages = listOf(
            "كل يوم يعيشه المؤمن، غنيمة. لا تنسى نصيبك من القرآن",
            "{وَمَنْ أَعْرَضَ عَن ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنكًا} - هلم الى ذكر الله",
            "{من قرأ حرفًا من كتابِ اللهِ فله به حسنةٌ، والحسنةُ بعشرِ أمثالِها} - سارع الى احرف من نور تكون لك نورا في دنياك واخرتك",
            "{لا يزالُ لسانُك رطبًا من ذكرِ اللهِ}",
            "{وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ} - لا تنسى وردك اليومي من القرآن",
            "لا تزاحِم مع القرآن غيره.. آثِره بوقتك يؤثرك بفضله. وقدِّمه في أول اليوم يقدِّمك على سائر القوم. افتح مصحفك واقرأ وِردك.",
            "{كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ} - مَا زاحم القرآن شيئاً إلا باركهُ ولاضيقاُ إلا أوسعهُ ولا ظلمة إلا أنارها ولا وحدة إلا آنسها",
            "ما خذلَ القرآن أهله قطّ لا في الدُّنيا ولا في الآخرة، حتى إذا فارق العبد الدُّنيا، ولُفّ في كفنه، وأُنزل إلى لحدِه، وأُوسِد في قبره، أتى له القرآن شافعًا",
            "{اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لأَصْحَابِهِ}",
            "{أهل القرآن هم أهل الله وخاصته}",
            "{إِنَّ ٱلَّذِینَ یَتۡلُونَ كِتَـٰبَ ٱللَّهِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ یَرۡجُونَ تِجَـٰرَةࣰ لَّن تَبُورَ()لِیُوَفِّیَهُمۡ أُجُورَهُمۡ وَیَزِیدَهُم مِّن فَضۡلِهِۦۤۚ إِنَّهُۥ غَفُورࣱ شَكُورࣱ}",
            "{إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَارَةً لَّن تَبُورَ}",
            "لا تنقطع عن حفظ القرآن ولو كان بضع آيات أو آية في كل يوم وكل بحسب وسعه",
            "{الماهر بالقرآن مع السفرة الكرام البررة، والذي يقرأ القرآن ويتعتع فيه وهو عليه شاق له أجران}",
            "{تعاهدوا هذا القرآن، فوالذي نفسي بيده لهو أشد تفلُّتاً من الإبل في عقلها}",
            "كان من وصية بعض أهل العلم لولده قوله له: (اقرأ القرآن وكأنه عليك أُنزل)",
            "{وَلَقَدْ يَسَّرْنَا الْقُرْءَانَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ}",
            /*"",
            "",
            "",
            "",
            "",
            "",*/
        )

        return messages.random();
    }
}