package com.ottrojja.screens.reminderScreen.classes

object DynamicMessageProvider {
    fun getMessage(): String {
        val messages = listOf(
            "مثل المؤمن الذي يقرأ القرآن كمثل الأترجة، ريحها طيب وطعمها طيب",
            "كل يوم يعيشه المؤمن، غنيمة. لا تنسى نصيبك من القرآن",
            "{وَمَنْ أَعْرَضَ عَن ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنكًا} - هلم الى ذكر الله",
            "{من قرأ حرفًا من كتابِ اللهِ فله به حسنةٌ، والحسنةُ بعشرِ أمثالِها} - سارع الى احرف من نور تكون لك نورا في دنياك واخرتك",
            "{لا يزالُ لسانُك رطبًا من ذكرِ اللهِ}",
            "{وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ} - لا تنسى وردك اليومي من القرآن",
            "لا تزاحِم مع القرآن غيره.. آثِره بوقتك يؤثرك بفضله. وقدِّمه في أول اليوم يقدِّمك على سائر القوم. افتح مصحفك واقرأ وِردك.",
            "{كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ}",
            "ما خذلَ القرآن أهله قطّ لا في الدُّنيا ولا في الآخرة، حتى إذا فارق العبد الدُّنيا، ولُفّ في كفنه، وأُنزل إلى لحدِه، وأُوسِد في قبره، أتى له القرآن شافعًا",
            "{اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لأَصْحَابِهِ}",
            "{أهل القرآن هم أهل الله وخاصته}",
            "{إِنَّ ٱلَّذِینَ یَتۡلُونَ كِتَـٰبَ ٱللَّهِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ یَرۡجُونَ تِجَـٰرَةࣰ لَّن تَبُورَ()لِیُوَفِّیَهُمۡ أُجُورَهُمۡ وَیَزِیدَهُم مِّن فَضۡلِهِۦۤۚ إِنَّهُۥ غَفُورࣱ شَكُورࣱ}",
            "لا تنقطع عن حفظ القرآن ولو كان بضع آيات أو آية في كل يوم وكل بحسب وسعه",
            "{الَّذِي يَقْرَأُ القُرْآنَ وَهُو ماهِرٌ بِهِ معَ السَّفَرةِ الكِرَامِ البَرَرَةِ، وَالَّذِي يقرَأُ القُرْآنَ ويَتَتَعْتَعُ فِيهِ وَهُو عليهِ شَاقٌّ لَهُ أَجْران}",
            "{تعاهدوا هذا القرآن، فوالذي نفسي بيده لهو أشد تفلُّتاً من الإبل في عقلها}",
            "كان من وصية بعض أهل العلم لولده قوله له: (اقرأ القرآن وكأنه عليك أُنزل)",
            "{وَلَقَدْ يَسَّرْنَا الْقُرْءَانَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ}",
            "قيل للحسن البصري: فلان يحفظ القرآن. قال: بل القرآن يحفظه!",
            "مَا زاحم القرآن شيئاً إلا باركهُ ولاضيقاُ إلا أوسعهُ ولا ظلمة إلا أنارها ولا وحدة إلا آنسها",
            "{وَإِنَّهُ لَكِتَابٌ عَزِيزٌ}",
            "من أحب أن يكلمه الله تعالى فليقرأ القرآن",
            /*"",
            "",*/
        )

        return messages.random();
    }
}